blog/_posts/2013-11/2013-11-15-ubuntu-init.html
---
layout: post
keywords: 
description: 
title: 装完ubuntu要做的事
categories: linux
tags: [linux,ubuntu]
group: archive
icon: globe
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 更新</a></li>
<li><a href="#sec-2">2 常用软件</a>
<ul>
<li><a href="#sec-2-1">2.1 apt-get</a></li>
<li><a href="#sec-2-2">2.2 手动装</a></li>
<li><a href="#sec-2-3">2.3 soft center</a></li>
</ul>
</li>
<li><a href="#sec-3">3 输入法</a></li>
<li><a href="#sec-4">4 图形化svn工具Rabbitvcs</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">更新</h2>
<div class="outline-text-2" id="text-1">




<pre class="example">sudo apt-get update
</pre>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">常用软件</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">apt-get</h3>
<div class="outline-text-3" id="text-2-1">

<p>vim  firefox git 
</p></div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">手动装</h3>
<div class="outline-text-3" id="text-2-2">

<p>emacs24 nutstore goagent idea jekyll
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">soft center</h3>
<div class="outline-text-3" id="text-2-3">

<p>flash plugins
</p></div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">输入法</h2>
<div class="outline-text-2" id="text-3">

<p>ibus-rime输入法
</p>


<pre class="example">sudo add-apt-repository ppa:lotem/rime
sudo apt-get update
sudo apt-get install ibus-rime
</pre>

<p>
装完后，桌面右上角重启下输入法，添加rime。
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">图形化svn工具Rabbitvcs</h2>
<div class="outline-text-2" id="text-4">




<pre class="example">sudo add-apt-repository ppa:rabbitvcs/ppa
sudo apt-get update
sudo apt-get install rabbitvcs-core rabbitvcs-nautilus3 rabbitvcs-gedit rabbitvcs-cli
</pre>

<p>
注销或重启，在文件夹和文件夹内点击鼠标右键就用RabbitVCS操作工具了.elementary os默认的Pantheon Files文件管理器看不到svn的文件夹标记，右键菜单也没有svn的快捷操作，终端启动nautilus文件管理器即可。
</p></div>
</div>
